programming/cpp/idiots-code.org
#+title: idiots-code
#+options: num:nil ^:nil creator:nil author:nil timestamp:nil tasks:nil

* 2.1 Using the cout Command.
#+BEGIN_SRC cpp :tangle 2_1.cpp :padline no
  #include <iostream>

  using namespace std;

  main()
  {
    cout << "Hello everyone...this is easy ";
    return(0);
  }
#+END_SRC

* 2.2 A Program with Several Lines of Text and endl.
#+BEGIN_SRC cpp :tangle 2_2.cpp :padline no
  #include <iostream>

  using namespace std;

  main()
  {
    cout << "Hello everyone...this is easy " << endl;
    cout << "Look a new line!" << endl;
    cout << "Get the idea!!" << endl << endl;
    cout << "Dead easy...isn't it?" << endl;
    return(0);
  }
#+END_SRC

* 2.3 Using Defined Messages.
#+BEGIN_SRC cpp :tangle 2_3.cpp :padline no
  #include <iostream>

  using namespace std;

  #define message1 "Hello everyone...this is easy "
  #define message2 "Look another line!"

  main()

  {
    cout << message1 << endl;
    cout << message2;
    cout << endl << endl << message1 << endl << endl;
    cout << message2 << endl;
    return(0);
  }
#+END_SRC

* 2.4 Mixed Data Types.
#+BEGIN_SRC cpp :tangle 2_4.cpp :padline no
  #include <iostream>

  using namespace std;

  main()
  {
    cout << "The answer to" << endl;
    cout << "LIFE THE UNIVERSE AND EVERYTHING is : ";
    cout << 42;
    cout << endl << endl;
    cout << "But what was the question?";
    cout << endl << endl;
    return(0);
  }
#+END_SRC
* 3.1 How to Show the Contents of an Integer Variable Onscreen.
#+BEGIN_SRC cpp :tangle 3_1.cpp :padline no
  #include <iostream>

  using namespace std;

  main()

  {
    int number;        //set up an integer variable
    number = 42;         //give it a value
    cout << number;      //display to screen
    return(0);
  }
#+END_SRC

* 3.2 How to Show the Contents of a char Variable Onscreen.
#+BEGIN_SRC cpp :tangle 3_2.cpp :padline no
  #include <iostream>

  using namespace std;

  main()

  {
    char letter;        // set up a character variable
    letter = 'C';         // give it a value
    cout << letter;       // display to screen
    return(0);
  }
#+END_SRC

* 3.3 How to Show the Contents of a float Variable Onscreen.
#+BEGIN_SRC cpp :tangle 3_3.cpp :padline no
  #include <iostream>

  using namespace std;

  main()
  {
    float number2;          // set up a float variable
    number2 = 98.6;         // give it a value
    cout << number2;          // display to screen
    return(0);
  }
#+END_SRC

* 3.4 An Example to Show the Size of the Box.
#+BEGIN_SRC cpp :tangle 3_4.cpp :padline no
  #include <iostream>

  using namespace std;

  main()
  {
    int box1   = 52;
    float box2 = 98.6;
    char box3  = 'Z';
    int size;

    size = sizeof(box1);
    cout << "The integer box is     : " << size << " bytes" << endl;
    cout << "This variable contains : " << box1 << endl;
    cout << endl;

    size = sizeof(box2);
    cout << "The float box is       : " << size << " bytes" << endl;
    cout << "This variable contains : " << box2 << endl;

    size = sizeof(box3);
    cout << endl;
    cout << "The char box is        : " << size  << " bytes" << endl;
    cout << "This variable contains : " << box3 << endl;
    cout << endl;
    cout << endl;
    return(0);
  }
#+END_SRC

* 4.1 Demonstrating Add, Subtract, and Multiply.
#+BEGIN_SRC cpp :tangle 4_1.cpp :padline no
  #include <iostream>

  using namespace std;

  main()

  {
    int A = 12;
    int B = 22;
    int C;
    int D;
    int E;

    C = A + B;                       // ADD
    D = A - B;                       // SUBTRACT
    E = A * B;                       // MULTIPLY

    cout << "ADD  : " << C << endl;
    cout << "SUB  : " << D << endl;
    cout << "MULT : " << E << endl;

    return(0);
  }
#+END_SRC
* 4.2 Demonstrating a Quirky C++ Division.
#+BEGIN_SRC cpp :tangle 4_2.cpp :padline no
  #include <iostream>

  using namespace std;

  main()

  {
    int A = 3;
    int B = 2;
    float C;

    C = A / B;                    // DIVIDE

    cout << "DIVIDE  : " << C << endl;

    return(0);
  }
#+END_SRC

* 4.3 Demonstrating a Nonquirky C++ Division.
#+BEGIN_SRC cpp :tangle 4_3.cpp :padline no
  #include <iostream>

  using namespace std;

  main()

  {
    float A = 3;
    float B = 2;
    float C;

    C = A / B;                    // DIVIDE

    cout << "DIVIDE  : " << C << endl;

    return(0);
  }
#+END_SRC

* 4.4 Demonstrating the Cast Operation.
#+BEGIN_SRC cpp :tangle 4_4.cpp :padline no
  #include <iostream>

  using namespace std;

  main()

  {
    int A = 3;
    int B = 2;
    float C;

    C = (float)A / B;        // CAST AND DIVIDE

    cout << "DIVIDE  : " << C << endl;

    return(0);
  }
#+END_SRC
