programming/cpp/idiots-code.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>idiots-code</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">idiots-code</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">2.1 Using the cout Command.</a></li>
<li><a href="#sec-2">2.2 A Program with Several Lines of Text and endl.</a></li>
<li><a href="#sec-3">2.3 Using Defined Messages.</a></li>
<li><a href="#sec-4">2.4 Mixed Data Types.</a></li>
<li><a href="#sec-5">3.1 How to Show the Contents of an Integer Variable Onscreen.</a></li>
<li><a href="#sec-6">3.2 How to Show the Contents of a char Variable Onscreen.</a></li>
<li><a href="#sec-7">3.3 How to Show the Contents of a float Variable Onscreen.</a></li>
<li><a href="#sec-8">3.4 An Example to Show the Size of the Box.</a></li>
<li><a href="#sec-9">4.1 Demonstrating Add, Subtract, and Multiply.</a></li>
<li><a href="#sec-10">4.2 Demonstrating a Quirky C++ Division.</a></li>
<li><a href="#sec-11">4.3 Demonstrating a Nonquirky C++ Division.</a></li>
<li><a href="#sec-12">4.4 Demonstrating the Cast Operation.</a></li>
<li><a href="#sec-13">4.5 Demonstrating Divide and Subtract to Find the Decimal Part of the Calculation.</a></li>
<li><a href="#sec-14">4.6 Demonstrating cin and a Further Demo of Add, Subtract, and Multiply.</a></li>
<li><a href="#sec-15">5.1 Demonstrating a Simple for Loop That Counts from 0 to 9</a></li>
<li><a href="#sec-16">5.2 The Running Total Program Finding the Total of a Number of Values Entered at Runtime.</a></li>
<li><a href="#sec-17">5.3 Converting All Character Inputs to Uppercase.</a></li>
<li><a href="#sec-18">5.4 Counting in Reverse.</a></li>
<li><a href="#sec-19">6.1 Demonstrating a while Loop That Counts from 0 to 9.</a></li>
<li><a href="#sec-20">6.2 Using Postfix Notation to Print Numbers Between 1 and 10.</a></li>
<li><a href="#sec-21">6.3 Using Prefix Notation to Print Numbers Between 1 and 9.</a></li>
<li><a href="#sec-22">6.4 Printing Numbers Between 0 and 9.</a></li>
<li><a href="#sec-23">7.1 A Simple Example of the if else Statement.</a></li>
<li><a href="#sec-24">7.2 An Example of Compound Statements Used with the if else Statement.</a></li>
<li><a href="#sec-25">7.3 An Example of a Program with No Required Actions If the Condition Proves False.</a></li>
<li><a href="#sec-26">7.4 An Example of the Nested if else Statement.</a></li>
<li><a href="#sec-27">7.5 An Example of a Heavily Nested if else Program.</a></li>
<li><a href="#sec-28">8.1 The Vowel Test.</a></li>
<li><a href="#sec-29">8.2 The Vowel Test in a Nest (This is meant to be a bad example).</a></li>
<li><a href="#sec-30">8.3 Demo of a Menu-Driven Program.</a></li>
<li><a href="#sec-31">9.1 Demo of a Six-Element Array.</a></li>
<li><a href="#sec-32">9.2 An Array of Integers that Demonstrates the Alignment of Columns.</a></li>
<li><a href="#sec-33">9.3 Creating an Array of Integers Example #1.</a></li>
<li><a href="#sec-34">9.4 Creating an Array of Integers Example #2.</a></li>
<li><a href="#sec-35">9.5 Example of the getline Function.</a></li>
<li><a href="#sec-36">10.1 Demo of a Two-Dimensional Array.</a></li>
<li><a href="#sec-37">10.2 Using a Two-Dimensional Array to List a Particular Row.</a></li>
<li><a href="#sec-38">10.3 Using a Two-Dimensional Array to List a Particular Column.</a></li>
<li><a href="#sec-39">10.4 Demo of a Three-Dimensional Array.</a></li>
<li><a href="#sec-40">10.5 Example of a Two-Dimensional Array of Characters.</a></li>
<li><a href="#sec-41">11.1 A Parallel Array.</a></li>
<li><a href="#sec-42">11.2 Vulcan Discovered At Last.</a></li>
<li><a href="#sec-43">11.3 Four Parallel Arrays.</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">2.1 Using the cout Command.</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()
{
  cout &lt;&lt; "Hello everyone...this is easy ";
  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">2.2 A Program with Several Lines of Text and endl.</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()
{
  cout &lt;&lt; "Hello everyone...this is easy " &lt;&lt; endl;
  cout &lt;&lt; "Look a new line!" &lt;&lt; endl;
  cout &lt;&lt; "Get the idea!!" &lt;&lt; endl &lt;&lt; endl;
  cout &lt;&lt; "Dead easy...isn't it?" &lt;&lt; endl;
  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">2.3 Using Defined Messages.</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

#define message1 "Hello everyone...this is easy "
#define message2 "Look another line!"

main()

{
  cout &lt;&lt; message1 &lt;&lt; endl;
  cout &lt;&lt; message2;
  cout &lt;&lt; endl &lt;&lt; endl &lt;&lt; message1 &lt;&lt; endl &lt;&lt; endl;
  cout &lt;&lt; message2 &lt;&lt; endl;
  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">2.4 Mixed Data Types.</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()
{
  cout &lt;&lt; "The answer to" &lt;&lt; endl;
  cout &lt;&lt; "LIFE THE UNIVERSE AND EVERYTHING is : ";
  cout &lt;&lt; 42;
  cout &lt;&lt; endl &lt;&lt; endl;
  cout &lt;&lt; "But what was the question?";
  cout &lt;&lt; endl &lt;&lt; endl;
  return(0);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">3.1 How to Show the Contents of an Integer Variable Onscreen.</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()

{
  int number;        //set up an integer variable
  number = 42;         //give it a value
  cout &lt;&lt; number;      //display to screen
  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">3.2 How to Show the Contents of a char Variable Onscreen.</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()

{
  char letter;        // set up a character variable
  letter = 'C';         // give it a value
  cout &lt;&lt; letter;       // display to screen
  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">3.3 How to Show the Contents of a float Variable Onscreen.</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()
{
  float number2;          // set up a float variable
  number2 = 98.6;         // give it a value
  cout &lt;&lt; number2;          // display to screen
  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">3.4 An Example to Show the Size of the Box.</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()
{
  int box1   = 52;
  float box2 = 98.6;
  char box3  = 'Z';
  int size;

  size = sizeof(box1);
  cout &lt;&lt; "The integer box is     : " &lt;&lt; size &lt;&lt; " bytes" &lt;&lt; endl;
  cout &lt;&lt; "This variable contains : " &lt;&lt; box1 &lt;&lt; endl;
  cout &lt;&lt; endl;

  size = sizeof(box2);
  cout &lt;&lt; "The float box is       : " &lt;&lt; size &lt;&lt; " bytes" &lt;&lt; endl;
  cout &lt;&lt; "This variable contains : " &lt;&lt; box2 &lt;&lt; endl;

  size = sizeof(box3);
  cout &lt;&lt; endl;
  cout &lt;&lt; "The char box is        : " &lt;&lt; size  &lt;&lt; " bytes" &lt;&lt; endl;
  cout &lt;&lt; "This variable contains : " &lt;&lt; box3 &lt;&lt; endl;
  cout &lt;&lt; endl;
  cout &lt;&lt; endl;
  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">4.1 Demonstrating Add, Subtract, and Multiply.</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()

{
  int A = 12;
  int B = 22;
  int C;
  int D;
  int E;

  C = A + B;                       // ADD
  D = A - B;                       // SUBTRACT
  E = A * B;                       // MULTIPLY

  cout &lt;&lt; "ADD  : " &lt;&lt; C &lt;&lt; endl;
  cout &lt;&lt; "SUB  : " &lt;&lt; D &lt;&lt; endl;
  cout &lt;&lt; "MULT : " &lt;&lt; E &lt;&lt; endl;

  return(0);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">4.2 Demonstrating a Quirky C++ Division.</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()

{
  int A = 3;
  int B = 2;
  float C;

  C = A / B;                    // DIVIDE

  cout &lt;&lt; "DIVIDE  : " &lt;&lt; C &lt;&lt; endl;

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">4.3 Demonstrating a Nonquirky C++ Division.</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()

{
  float A = 3;
  float B = 2;
  float C;

  C = A / B;                    // DIVIDE

  cout &lt;&lt; "DIVIDE  : " &lt;&lt; C &lt;&lt; endl;

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">4.4 Demonstrating the Cast Operation.</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()

{
  int A = 3;
  int B = 2;
  float C;

  C = (float)A / B;        // CAST AND DIVIDE

  cout &lt;&lt; "DIVIDE  : " &lt;&lt; C &lt;&lt; endl;

  return(0);
}
</pre>
</div>
</div>
</div>
