programming/cpp/idiots-code.org
* 4.5 Demonstrating Divide and Subtract to Find the Decimal Part of the Calculation.
#+BEGIN_SRC cpp :tangle 4_5.cpp :padline no
  #include <iostream>

  using namespace std;

  main()

  {
    int A = 3;
    int B = 2;
    float C;
    float D;
    float E;

    C = A / B;                            // DIVIDE
    D = (float)A / B;                     // CAST
    E = D - C;                            // DECIMAL BIT

    cout << "DECIMAL  : " << E << endl;

    return(0);
  }
#+END_SRC
* 4.6 Demonstrating cin and a Further Demo of Add, Subtract, and Multiply.
#+BEGIN_SRC cpp :tangle 4_6.cpp :padline no
  #include <iostream>

  using namespace std;

  main()

  {

    int A;
    int B;
    int C;
    int D;
    int E;

    cout << "Enter the value for A : ";
    cin >> A;
    cout << "Enter the value for B : ";
    cin >> B;

    C = A + B;                       // ADD
    D = A - B;                       // SUBTRACT
    E = A * B;                       // MULTIPLY

    cout << "ADD  : " << C << endl;
    cout << "SUB  : "  << D << endl;
    cout << "MULT : " << E << endl;

    return(0);
  }
#+END_SRC

* 5.1 Demonstrating a Simple for Loop That Counts from 0 to 9
#+BEGIN_SRC cpp :tangle 5_1.cpp :padline no
  #include <iostream>

  using namespace std;

  main()

  {
    int x;

    for (x = 0; x < 10; x++)
      {
        cout << x  << endl;
      }

    return(0);
  }
#+END_SRC
* 5.2 The Running Total Program Finding the Total of a Number of Values Entered at Runtime.
#+BEGIN_SRC cpp :tangle 5_2.cpp :padline no
  #include <iostream>

  using namespace std;

  main()

  {
    int loop;
    int total = 0;       // declare and initialize variables
    int number = 0;

    for (loop = 1; loop <= 5; loop++)
      {
        cout << "Enter a number : ";
        cin >> number;
        total += number;            // keep running total
      }

    cout << endl << "The total is " << total;

    return(0);
  }
#+END_SRC

* 5.3 Converting All Character Inputs to Uppercase.
#+BEGIN_SRC cpp :tangle 5_3.cpp :padline no
  #include <iostream>
  #include <cstring>
  #include <cctype>

  using namespace std;

  #define MAX 20

  main()

  {
    char name[MAX];
    int x;

    cout << "Enter a name : ";
    cin >> name;

    for (x = 0; x < strlen(name); x++)
      {
        name[x] = toupper(name[x]);
      }

    cout << endl << name << endl;

    return(0);
  }
#+END_SRC

* 5.4 Counting in Reverse.
#+BEGIN_SRC cpp :tangle 5_4.cpp :padline no
  #include <iostream>

  using namespace std;

  main()

  {
    int x;

    for (x = 10; x > 0; x--)
      {
        cout << x  << endl;
      }

    return(0);
  }
#+END_SRC

* 6.1 Demonstrating a while Loop That Counts from 0 to 9.
#+BEGIN_SRC cpp :tangle 6_1.cpp :padline no
  #include <iostream>

  using namespace std;

  main()
  {
    int counter = 0;                 //set initial value

    while ( counter < 10)            //test condition
      {
        cout << counter << " ";      //display
        counter++;                   //increment
      }

    return(0);
  }
  #+END_SRC

* 6.2 Using Postfix Notation to Print Numbers Between 1 and 10.
#+BEGIN_SRC cpp :tangle 6_2.cpp :padline no
  #include <iostream>

  using namespace std;

  main()
  {

    int counter = 0;              //set initial value

    while ( counter++ < 10)       //test condition and increment
      {
        cout << counter << " ";   //display
      }

    return(0);
  }
#+END_SRC

* 6.3 Using Prefix Notation to Print Numbers Between 1 and 9.
#+BEGIN_SRC cpp :tangle 6_3.cpp :padline no
  #include <iostream>

  using namespace std;

  main()
  {
    int counter = 0;              //set initial value

    while ( ++counter < 10)       //test condition and increment
      {
        cout << counter << " ";   //display
      }

    return(0);
  }
#+END_SRC

* 6.4 Printing Numbers Between 0 and 9.
#+BEGIN_SRC cpp :tangle 6_4.cpp :padline no
  #include <iostream>

  using namespace std;

  main()
  {
    int counter = 0;                     //set initial value

    do
      {
        cout << counter << " ";       //display
        counter++;                    //increment
      } while ( counter < 10);              //test condition

    return(0);
  }
#+END_SRC

* 7.1 A Simple Example of the if else Statement.
#+BEGIN_SRC cpp :tangle 7_1.cpp :padline no
  #include <iostream>

  using namespace std;

  main()
  {
    int age;

    cout << "Enter your age : ";
    cin >> age;

    if (age >= 18)
      {
        cout << "You can vote " << endl;
      }

    else
      {
        cout << "Too young to vote" << endl;
      }

    return(0);
  }
#+END_SRC

* 7.2 An Example of Compound Statements Used with the if else Statement.
#+BEGIN_SRC cpp :tangle 7_2.cpp :padline no
  #include <iostream>

  using namespace std;

  main()
  {
    int age;

    cout << "Enter your age : ";
    cin >> age;

    if (age >= 18)
      {
        cout << "Hello I am your local senator" << endl;
        cout << "You are over 18" << endl;
        cout << "That means you can vote" << endl;
        cout << "I will crawl to you" << endl;
      }

    else
      {
        cout << "Too young to vote" << endl;
        cout << "Do not waste my time" << endl;
      }

    return(0);
  }
#+END_SRC

* 7.3 An Example of a Program with No Required Actions If the Condition Proves False.
#+BEGIN_SRC cpp :tangle 7_3.cpp :padline no
  #include <iostream>

  using namespace std;

  main()
  {
    int age;

    cout <<"Enter your age : ";
    cin >> age;

    if (age >= 18)
      {
        cout << "Hello I am your local Senator" << endl;
        cout << "You are over 18" << endl;
        cout << "That means you can vote" << endl;
        cout << "I will crawl to you" << endl;
      }    

    return(0);
  }
#+END_SRC

* 7.4 An Example of the Nested if else Statement.
#+BEGIN_SRC cpp :tangle 7_4.cpp :padline no
  #include <iostream>

  using namespace std;

  #define MyAge 21    // Don't laugh!

  main()
  {
    int guess;

    cout <<"Guess my age : ";
    cin >> guess;

    if (guess == MyAge)
      {
        cout << endl
             << "Congratulations you are a friend for life"
             << endl;
      }

    else
      {
        if (guess < MyAge)
          {
            cout << "Come on. . .I am older than that" << endl;
          }

        else
          {
            cout << "Do not be so cheeky" << endl;
          }
      }

    return(0);
  }
  #+END_SRC

