programming/cpp/idiots-code.html
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">4.5 Demonstrating Divide and Subtract to Find the Decimal Part of the Calculation.</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()

{
  int A = 3;
  int B = 2;
  float C;
  float D;
  float E;

  C = A / B;                            // DIVIDE
  D = (float)A / B;                     // CAST
  E = D - C;                            // DECIMAL BIT

  cout &lt;&lt; "DECIMAL  : " &lt;&lt; E &lt;&lt; endl;

  return(0);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">4.6 Demonstrating cin and a Further Demo of Add, Subtract, and Multiply.</h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()

{

  int A;
  int B;
  int C;
  int D;
  int E;

  cout &lt;&lt; "Enter the value for A : ";
  cin &gt;&gt; A;
  cout &lt;&lt; "Enter the value for B : ";
  cin &gt;&gt; B;

  C = A + B;                       // ADD
  D = A - B;                       // SUBTRACT
  E = A * B;                       // MULTIPLY

  cout &lt;&lt; "ADD  : " &lt;&lt; C &lt;&lt; endl;
  cout &lt;&lt; "SUB  : "  &lt;&lt; D &lt;&lt; endl;
  cout &lt;&lt; "MULT : " &lt;&lt; E &lt;&lt; endl;

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15">5.1 Demonstrating a Simple for Loop That Counts from 0 to 9</h2>
<div class="outline-text-2" id="text-15">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()

{
  int x;

  for (x = 0; x &lt; 10; x++)
    {
      cout &lt;&lt; x  &lt;&lt; endl;
    }

  return(0);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16">5.2 The Running Total Program Finding the Total of a Number of Values Entered at Runtime.</h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()

{
  int loop;
  int total = 0;       // declare and initialize variables
  int number = 0;

  for (loop = 1; loop &lt;= 5; loop++)
    {
      cout &lt;&lt; "Enter a number : ";
      cin &gt;&gt; number;
      total += number;            // keep running total
    }

  cout &lt;&lt; endl &lt;&lt; "The total is " &lt;&lt; total;

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17">5.3 Converting All Character Inputs to Uppercase.</h2>
<div class="outline-text-2" id="text-17">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;
#include &lt;cstring&gt;
#include &lt;cctype&gt;

using namespace std;

#define MAX 20

main()

{
  char name[MAX];
  int x;

  cout &lt;&lt; "Enter a name : ";
  cin &gt;&gt; name;

  for (x = 0; x &lt; strlen(name); x++)
    {
      name[x] = toupper(name[x]);
    }

  cout &lt;&lt; endl &lt;&lt; name &lt;&lt; endl;

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18">5.4 Counting in Reverse.</h2>
<div class="outline-text-2" id="text-18">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()

{
  int x;

  for (x = 10; x &gt; 0; x--)
    {
      cout &lt;&lt; x  &lt;&lt; endl;
    }

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19">6.1 Demonstrating a while Loop That Counts from 0 to 9.</h2>
<div class="outline-text-2" id="text-19">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()
{
  int counter = 0;                 //set initial value

  while ( counter &lt; 10)            //test condition
    {
      cout &lt;&lt; counter &lt;&lt; " ";      //display
      counter++;                   //increment
    }

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20">6.2 Using Postfix Notation to Print Numbers Between 1 and 10.</h2>
<div class="outline-text-2" id="text-20">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()
{

  int counter = 0;              //set initial value

  while ( counter++ &lt; 10)       //test condition and increment
    {
      cout &lt;&lt; counter &lt;&lt; " ";   //display
    }

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21">6.3 Using Prefix Notation to Print Numbers Between 1 and 9.</h2>
<div class="outline-text-2" id="text-21">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()
{
  int counter = 0;              //set initial value

  while ( ++counter &lt; 10)       //test condition and increment
    {
      cout &lt;&lt; counter &lt;&lt; " ";   //display
    }

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22">6.4 Printing Numbers Between 0 and 9.</h2>
<div class="outline-text-2" id="text-22">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()
{
  int counter = 0;                     //set initial value

  do
    {
      cout &lt;&lt; counter &lt;&lt; " ";       //display
      counter++;                    //increment
    } while ( counter &lt; 10);              //test condition

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23">7.1 A Simple Example of the if else Statement.</h2>
<div class="outline-text-2" id="text-23">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()
{
  int age;

  cout &lt;&lt; "Enter your age : ";
  cin &gt;&gt; age;

  if (age &gt;= 18)
    {
      cout &lt;&lt; "You can vote " &lt;&lt; endl;
    }

  else
    {
      cout &lt;&lt; "Too young to vote" &lt;&lt; endl;
    }

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24">7.2 An Example of Compound Statements Used with the if else Statement.</h2>
<div class="outline-text-2" id="text-24">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()
{
  int age;

  cout &lt;&lt; "Enter your age : ";
  cin &gt;&gt; age;

  if (age &gt;= 18)
    {
      cout &lt;&lt; "Hello I am your local senator" &lt;&lt; endl;
      cout &lt;&lt; "You are over 18" &lt;&lt; endl;
      cout &lt;&lt; "That means you can vote" &lt;&lt; endl;
      cout &lt;&lt; "I will crawl to you" &lt;&lt; endl;
    }

  else
    {
      cout &lt;&lt; "Too young to vote" &lt;&lt; endl;
      cout &lt;&lt; "Do not waste my time" &lt;&lt; endl;
    }

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25">7.3 An Example of a Program with No Required Actions If the Condition Proves False.</h2>
<div class="outline-text-2" id="text-25">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()
{
  int age;

  cout &lt;&lt;"Enter your age : ";
  cin &gt;&gt; age;

  if (age &gt;= 18)
    {
      cout &lt;&lt; "Hello I am your local Senator" &lt;&lt; endl;
      cout &lt;&lt; "You are over 18" &lt;&lt; endl;
      cout &lt;&lt; "That means you can vote" &lt;&lt; endl;
      cout &lt;&lt; "I will crawl to you" &lt;&lt; endl;
    }    

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26">7.4 An Example of the Nested if else Statement.</h2>
<div class="outline-text-2" id="text-26">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

#define MyAge 21    // Don't laugh!

main()
{
  int guess;

  cout &lt;&lt;"Guess my age : ";
  cin &gt;&gt; guess;

  if (guess == MyAge)
    {
      cout &lt;&lt; endl
	   &lt;&lt; "Congratulations you are a friend for life"
	   &lt;&lt; endl;
    }

  else
    {
      if (guess &lt; MyAge)
	{
	  cout &lt;&lt; "Come on. . .I am older than that" &lt;&lt; endl;
	}

      else
	{
	  cout &lt;&lt; "Do not be so cheeky" &lt;&lt; endl;
	}
    }

  return(0);
}
</pre>
</div>
</div>
</div>
