programming/cpp/idiots-code.org
* 7.5 An Example of a Heavily Nested if else Program.
#+BEGIN_SRC cpp :tangle 7_5.cpp :padline no
  #include <iostream>

  using namespace std;

  main()
  {
    int age;
   
    cout << "Enter your age : ";
    cin >> age;
   
    if (age < 16)
      {
        if ( age < 5)
          {
            cout << "Under school age" << endl;
          }
        else
          {
            cout << "School age" << endl;
          }
      }
    else
      {
        if (age < 65)
          {
            cout << "Working age" << endl;
          }
        else
          {
            cout << "Over the hill" << endl;
          }
      }
    return(0);
  }
#+END_SRC

* 8.1 The Vowel Test.
#+BEGIN_SRC cpp :tangle 8_1.cpp :padline no
  #include <iostream>
  #include <cctype>

  using namespace std;

  #define message "This is a vowel"

  main()
  {
    char letter;

    cout << "Enter a letter : ";
    cin >> letter;
    letter = toupper(letter);
    switch (letter)
      {
      case 'A' :    cout << message << endl;
        break;
      case 'E' :    cout << message << endl;
        break;
      case 'I' :    cout << message << endl;
        break;
      case 'O' :    cout << message << endl;
        break;
      case 'U' :    cout << message << endl;
        break;
      default  :    cout << "Not a vowel" << endl;
  }
  return(0);
  }
#+END_SRC

* 8.2 The Vowel Test in a Nest (This is meant to be a bad example).
#+BEGIN_SRC cpp :tangle 8_2.cpp :padline no
  #include <iostream>
  #include <cctype>

  using namespace std;

  #define message "This is a vowel"

  main()
  {
    char letter;
    cout << "Enter a letter : ";
    cin >> letter;
    letter = toupper(letter);
    
    if (letter == 'A')
      {
        cout << message << endl;
      }
    else
      {
        if (letter == 'E')
          {
            cout << message << endl;
          }
        else
          if (letter == 'I')
            {
              cout << message << endl;
            }
          else
            {
              if (letter == 'O')
                {
                  cout << message << endl;
                }
              else
                {
                  if (letter =='U')
                    {
                      cout << message << endl;
                    }
                  else
                    {
                      cout << "Not a vowel"
                           << endl;
                    }
                }
            }
      }
    return(0);
  }
#+END_SRC

* 8.3 Demo of a Menu-Driven Program.
#+BEGIN_SRC cpp :tangle 8_3.cpp :padline no
  #include <iostream>
  #include <cstdlib>

  using namespace std;

  main()
  {
    char choice;
   
    do
      {
        // This is the menu displayed to the screen
        cout << "FLIGHT BOOKING SYSTEM" << endl << endl;
        cout << "1..New York to London Heathrow" << endl;
        cout << "2..New York to Vancouver" << endl;
        cout << "3..New York to Sydney" << endl;
        cout << "4..New York to Cape Town" << endl;
        cout << "Q..Quit" << endl;
        // This reads in the user selection.
        cout << endl << endl << "Enter your choice : ";
        cin >> choice;
        // This section acts on the user selection.
        switch (choice)
          {
          case '1' :     cout << endl
                              << "New York to London booked"
                              << endl << endl;
            break;
          case '2' :     cout << endl
                              << "New York to Vancouver booked"
                              << endl << endl;
            break;
          case '3' :     cout << endl
                              << "New York to Sydney booked"
                              << endl << endl;
            break;
          case '4' :     cout << endl
                              << "New York to Cape Town booked"
                              << endl << endl;
            break;
          case 'Q' :
          case 'q' :     exit(0);
          }
      } while(1);
    return(0);
  }
#+END_SRC
* 9.1 Demo of a Six-Element Array.
#+BEGIN_SRC cpp :tangle 9_1.cpp :padline no
  #include <iostream>

  using namespace std;

  main()
  {
    int number[6];            // an array of integer
    int index;                // loop control variable

    number[5] = 42;           // initialize the array
    number[4] = 2001;
    number[3] = 7;
    number[2] = 180;
    number[1] = 99;
    number[0] = 1993;

    for (index = 0; index <= 5; index++)
      {
        cout << number[index] << endl;
      }

    return(0);
  }
#+END_SRC

* 9.2 An Array of Integers that Demonstrates the Alignment of Columns.
#+BEGIN_SRC cpp :tangle 9_2.cpp :padline no
  #include <iostream>

  using namespace std;

  #define MAX 20

  main()
  {
    // declare and initialize an array
    int number[MAX] = {12,33,45,66,43,1,56,78,101,99};
    int index;

    cout.setf(ios::right);

    for (index = 0; index < MAX; index++)
      {
        cout << endl
             << "THE CONTENTS OF ARRAY ELEMENT";
        cout.width(4);
        cout << (index + 1)  <<  " IS :";
        cout.width(4);
        cout << number[index];
      }
    cout << endl << endl;

    return(0);
  }
#+END_SRC

* 9.3 Creating an Array of Integers Example #1.
#+BEGIN_SRC cpp :tangle 9_3.cpp :padline no
  #include <iostream>

  using namespace std;

  #define MAX 4

  main()
  {
    int number[MAX];        // declare empty array
    int index;

    // gather the data and put it in array
    for (index = 0; index < MAX; index ++)
      {
        cout << "Enter a number ";
        cin >> number[index];
      }

    // show array contents to screen
    for (index = 0; index < MAX; index++)
      {
        cout << endl
             << "THE CONTENTS OF ARRAY ELEMENT "
             << (index + 1) << " IS : ";
        cout << number[index];
      }

    cout << endl << endl;

    return(0);
  }
#+END_SRC

* 9.4 Creating an Array of Integers Example #2.
#+BEGIN_SRC cpp :tangle 9_4.cpp :padline no
  #include <iostream>

  using namespace std;

  #define MAX 40

  main()
  {
    int number[MAX];      // declare empty array
    int index;            // loop control variable
    int count = 0;        // keep count of elements used
    char more;            // is there more data?

    // gather the data and put it in array
    while(1)
      {
        cout << "Enter a number ";
        cin >> number[count];
        cout << "Any more items to enter y/n : ";
        cin >> more;

        if (more == 'n')
          {
            break;
          }
        else
          {
            count++;
          }
      }
    // show contents of array element
    //which contain data
    for (index = 0; index <= count; index++)
      {
        cout << endl
             << "THE CONTENTS OF ARRAY ELEMENT "
             << (index + 1) << " IS : ";
        cout << number[index];
      }
    cout << endl << "ARRAY ELEMENTS USED = "         << count+1;
    cout << endl << endl;

    return(0);
  }
#+END_SRC
* 9.5 Example of the getline Function.
#+BEGIN_SRC cpp :tangle 9_5.cpp :padline no
  #include <iostream>

  using namespace std;

  main()
  {
    char name[20];
    cout << "Enter a name ";
    cin.getline(name,20);
    cout << endl << name << endl << endl;

    return(0);
  }
#+END_SRC
