programming/cpp/idiots-code.html

<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27">7.5 An Example of a Heavily Nested if else Program.</h2>
<div class="outline-text-2" id="text-27">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()
{
  int age;

  cout &lt;&lt; "Enter your age : ";
  cin &gt;&gt; age;

  if (age &lt; 16)
    {
      if ( age &lt; 5)
	{
	  cout &lt;&lt; "Under school age" &lt;&lt; endl;
	}
      else
	{
	  cout &lt;&lt; "School age" &lt;&lt; endl;
	}
    }
  else
    {
      if (age &lt; 65)
	{
	  cout &lt;&lt; "Working age" &lt;&lt; endl;
	}
      else
	{
	  cout &lt;&lt; "Over the hill" &lt;&lt; endl;
	}
    }
  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28">8.1 The Vowel Test.</h2>
<div class="outline-text-2" id="text-28">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;
#include &lt;cctype&gt;

using namespace std;

#define message "This is a vowel"

main()
{
  char letter;

  cout &lt;&lt; "Enter a letter : ";
  cin &gt;&gt; letter;
  letter = toupper(letter);
  switch (letter)
    {
    case 'A' :    cout &lt;&lt; message &lt;&lt; endl;
      break;
    case 'E' :    cout &lt;&lt; message &lt;&lt; endl;
      break;
    case 'I' :    cout &lt;&lt; message &lt;&lt; endl;
      break;
    case 'O' :    cout &lt;&lt; message &lt;&lt; endl;
      break;
    case 'U' :    cout &lt;&lt; message &lt;&lt; endl;
      break;
    default  :    cout &lt;&lt; "Not a vowel" &lt;&lt; endl;
}
return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29">8.2 The Vowel Test in a Nest (This is meant to be a bad example).</h2>
<div class="outline-text-2" id="text-29">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;
#include &lt;cctype&gt;

using namespace std;

#define message "This is a vowel"

main()
{
  char letter;
  cout &lt;&lt; "Enter a letter : ";
  cin &gt;&gt; letter;
  letter = toupper(letter);

  if (letter == 'A')
    {
      cout &lt;&lt; message &lt;&lt; endl;
    }
  else
    {
      if (letter == 'E')
	{
	  cout &lt;&lt; message &lt;&lt; endl;
	}
      else
	if (letter == 'I')
	  {
	    cout &lt;&lt; message &lt;&lt; endl;
	  }
	else
	  {
	    if (letter == 'O')
	      {
		cout &lt;&lt; message &lt;&lt; endl;
	      }
	    else
	      {
		if (letter =='U')
		  {
		    cout &lt;&lt; message &lt;&lt; endl;
		  }
		else
		  {
		    cout &lt;&lt; "Not a vowel"
			 &lt;&lt; endl;
		  }
	      }
	  }
    }
  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-30" class="outline-2">
<h2 id="sec-30">8.3 Demo of a Menu-Driven Program.</h2>
<div class="outline-text-2" id="text-30">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;
#include &lt;cstdlib&gt;

using namespace std;

main()
{
  char choice;

  do
    {
      // This is the menu displayed to the screen
      cout &lt;&lt; "FLIGHT BOOKING SYSTEM" &lt;&lt; endl &lt;&lt; endl;
      cout &lt;&lt; "1..New York to London Heathrow" &lt;&lt; endl;
      cout &lt;&lt; "2..New York to Vancouver" &lt;&lt; endl;
      cout &lt;&lt; "3..New York to Sydney" &lt;&lt; endl;
      cout &lt;&lt; "4..New York to Cape Town" &lt;&lt; endl;
      cout &lt;&lt; "Q..Quit" &lt;&lt; endl;
      // This reads in the user selection.
      cout &lt;&lt; endl &lt;&lt; endl &lt;&lt; "Enter your choice : ";
      cin &gt;&gt; choice;
      // This section acts on the user selection.
      switch (choice)
	{
	case '1' :     cout &lt;&lt; endl
			    &lt;&lt; "New York to London booked"
			    &lt;&lt; endl &lt;&lt; endl;
	  break;
	case '2' :     cout &lt;&lt; endl
			    &lt;&lt; "New York to Vancouver booked"
			    &lt;&lt; endl &lt;&lt; endl;
	  break;
	case '3' :     cout &lt;&lt; endl
			    &lt;&lt; "New York to Sydney booked"
			    &lt;&lt; endl &lt;&lt; endl;
	  break;
	case '4' :     cout &lt;&lt; endl
			    &lt;&lt; "New York to Cape Town booked"
			    &lt;&lt; endl &lt;&lt; endl;
	  break;
	case 'Q' :
	case 'q' :     exit(0);
	}
    } while(1);
  return(0);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-31" class="outline-2">
<h2 id="sec-31">9.1 Demo of a Six-Element Array.</h2>
<div class="outline-text-2" id="text-31">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()
{
  int number[6];            // an array of integer
  int index;                // loop control variable

  number[5] = 42;           // initialize the array
  number[4] = 2001;
  number[3] = 7;
  number[2] = 180;
  number[1] = 99;
  number[0] = 1993;

  for (index = 0; index &lt;= 5; index++)
    {
      cout &lt;&lt; number[index] &lt;&lt; endl;
    }

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-32" class="outline-2">
<h2 id="sec-32">9.2 An Array of Integers that Demonstrates the Alignment of Columns.</h2>
<div class="outline-text-2" id="text-32">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

#define MAX 20

main()
{
  // declare and initialize an array
  int number[MAX] = {12,33,45,66,43,1,56,78,101,99};
  int index;

  cout.setf(ios::right);

  for (index = 0; index &lt; MAX; index++)
    {
      cout &lt;&lt; endl
	   &lt;&lt; "THE CONTENTS OF ARRAY ELEMENT";
      cout.width(4);
      cout &lt;&lt; (index + 1)  &lt;&lt;  " IS :";
      cout.width(4);
      cout &lt;&lt; number[index];
    }
  cout &lt;&lt; endl &lt;&lt; endl;

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-33" class="outline-2">
<h2 id="sec-33">9.3 Creating an Array of Integers Example #1.</h2>
<div class="outline-text-2" id="text-33">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

#define MAX 4

main()
{
  int number[MAX];        // declare empty array
  int index;

  // gather the data and put it in array
  for (index = 0; index &lt; MAX; index ++)
    {
      cout &lt;&lt; "Enter a number ";
      cin &gt;&gt; number[index];
    }

  // show array contents to screen
  for (index = 0; index &lt; MAX; index++)
    {
      cout &lt;&lt; endl
	   &lt;&lt; "THE CONTENTS OF ARRAY ELEMENT "
	   &lt;&lt; (index + 1) &lt;&lt; " IS : ";
      cout &lt;&lt; number[index];
    }

  cout &lt;&lt; endl &lt;&lt; endl;

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-34" class="outline-2">
<h2 id="sec-34">9.4 Creating an Array of Integers Example #2.</h2>
<div class="outline-text-2" id="text-34">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

#define MAX 40

main()
{
  int number[MAX];      // declare empty array
  int index;            // loop control variable
  int count = 0;        // keep count of elements used
  char more;            // is there more data?

  // gather the data and put it in array
  while(1)
    {
      cout &lt;&lt; "Enter a number ";
      cin &gt;&gt; number[count];
      cout &lt;&lt; "Any more items to enter y/n : ";
      cin &gt;&gt; more;

      if (more == 'n')
	{
	  break;
	}
      else
	{
	  count++;
	}
    }
  // show contents of array element
  //which contain data
  for (index = 0; index &lt;= count; index++)
    {
      cout &lt;&lt; endl
	   &lt;&lt; "THE CONTENTS OF ARRAY ELEMENT "
	   &lt;&lt; (index + 1) &lt;&lt; " IS : ";
      cout &lt;&lt; number[index];
    }
  cout &lt;&lt; endl &lt;&lt; "ARRAY ELEMENTS USED = "         &lt;&lt; count+1;
  cout &lt;&lt; endl &lt;&lt; endl;

  return(0);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-35" class="outline-2">
<h2 id="sec-35">9.5 Example of the getline Function.</h2>
<div class="outline-text-2" id="text-35">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

main()
{
  char name[20];
  cout &lt;&lt; "Enter a name ";
  cin.getline(name,20);
  cout &lt;&lt; endl &lt;&lt; name &lt;&lt; endl &lt;&lt; endl;

  return(0);
}
</pre>
</div>
</div>
</div>
