programming/cpp/idiots-code.org
* 10.1 Demo of a Two-Dimensional Array.
#+BEGIN_SRC cpp :tangle 10_1.cpp :padline no
  #include <iostream> 

  using namespace std;

  #define ROW 5           // FIVE WORKING DAYS
  #define COLUMN 4        // FOUR WEEKS IN MONTH

  main() 
  {
    int sales[ROW][COLUMN] = { 91,22,37,40,
                               58,63,99,35,
                               77,81,23,62,
                               92,15,33,29,
                               102,73,62,64};
    int down;        // go down the rows
    int across;        // go across the columns

    cout.setf(ios::right);
    cout << endl;

    for (down = 0; down < ROW; down++)
      {
        for (across = 0; across < COLUMN; across++)
          {
            cout.width(4);
            cout << sales[down][across];
          }
        cout << endl << endl;
      }

    return(0);
  }
#+END_SRC

* 10.2 Using a Two-Dimensional Array to List a Particular Row.
#+BEGIN_SRC cpp :tangle 10_2.cpp :padline no
  #include <iostream>

  using namespace std;

  #define ROW 5
  #define COLUMN 4

  main()
  {
    int sales[ROW][COLUMN] = {    91,22,37,40,
                                  58,63,99,35,
                                  77,81,23,62,
                                  92,15,33,29,
                                  102,73,62,64};
    int across;        // This is the columns

    cout.setf(ios::right);
    cout << endl << "A Day In The Month";
    cout << endl << endl;

    for (across = 0; across < COLUMN; across++)
      {
        cout.width(4);
        cout << sales[0][across];
      }
    cout << endl << endl;

    return(0);
  }
#+END_SRC

* 10.3 Using a Two-Dimensional Array to List a Particular Column.
#+BEGIN_SRC cpp :tangle 10_3.cpp :padline no
  #include <iostream>

  using namespace std;

  #define ROW 5
  #define COLUMN 4

  main() 
  {      
    int sales[ROW][COLUMN] = {    91,22,37,40,
                                  58,63,99,35,
                                  77,81,23,62,
                                  92,15,33,29,
                                  102,73,62,64};
    int down;        // This is the row

    cout.setf(ios::right);
    cout << endl << "A Week In The Month Observed.";
    cout << endl << endl;

    for (down = 0; down < ROW; down++)
      {
        cout.width(4);
        cout << sales[down][1] << endl;
      }
    cout << endl << endl;

    return(0);
  }
#+END_SRC

* 10.4 Demo of a Three-Dimensional Array.
#+BEGIN_SRC cpp :tangle 10_4.cpp :padline no
  #include <iostream>

  using namespace std;

  #define ROW 5                 // FIVE WORKING DAYS
  #define COLUMN 4              // FOUR WEEKS IN MONTH
  #define PAGE 2                // MONTHS 1 AND 2

  main()
  {
    int sales[ROW][COLUMN][PAGE];
    int down;
    int across;
    int back = 0;

    sales[0][0][0] = 91;
    sales[0][1][0] = 22;
    sales[0][2][0] = 37;
    sales[0][3][0] = 40;
    sales[1][0][0] = 58;
    sales[1][1][0] = 63;
    sales[1][2][0] = 99;
    sales[1][3][0] = 35;
    sales[2][0][0] = 77;
    sales[2][1][0] = 81;
    sales[2][2][0] = 23;
    sales[2][3][0] = 62;
    sales[3][0][0] = 92;
    sales[3][1][0] = 15;
    sales[3][2][0] = 33;
    sales[3][3][0] = 29;
    sales[4][0][0] = 102;
    sales[4][1][0] = 73;
    sales[4][2][0] = 62;
    sales[4][3][0] = 64;
    sales[0][0][1] = 12;
    sales[0][1][1] = 23;
    sales[0][2][1] = 27;
    sales[0][3][1] = 42;
    sales[1][0][1] = 59;
    sales[1][1][1] = 83;
    sales[1][2][1] = 79;
    sales[1][3][1] = 75;
    sales[2][0][1] = 77;
    sales[2][1][1] = 71;
    sales[2][2][1] = 63;
    sales[2][3][1] = 72;
    sales[3][0][1] = 110;
    sales[3][1][1] = 105;
    sales[3][2][1] = 103;
    sales[3][3][1] = 109;
    sales[4][0][1] = 102;
    sales[4][1][1] = 83;
    sales[4][2][1] = 61;
    sales[4][3][1] = 63;

    cout.setf(ios::right);
    cout << endl;

    for (down = 0; down < ROW; down++)
      {
        for (across = 0; across < COLUMN; across++)
          {
            cout.width(4);
            cout << sales[down][across][back];
          }
        cout << endl << endl;
      }
    back++;
    cout << endl << endl;
    for (down = 0; down < ROW; down++)
      {
        for (across = 0; across < COLUMN; across++)
          {
            cout.width(4);
            cout << sales[down][across][back];
          }
        cout << endl << endl;
      }

    return(0);
  }
#+END_SRC

* 10.5 Example of a Two-Dimensional Array of Characters.
#+BEGIN_SRC cpp :tangle 10_5.cpp :padline no
  #include <iostream>

  using namespace std;

  #define MAXNAMES 4        // FOUR NAMES IN ARRAY
  #define MAXLENGTH 20      // NOT MORE THAN 19 CHARACTERS

  main()
  {
    char name[MAXNAMES][MAXLENGTH] =     {
      "DAVY CROCKETT",
      "JOHN LENNON",
      "MOHAMMED ALI",
      "WILLIAM WALLACE"};
    int index;

    for (index = 0; index < MAXNAMES; index++)
      {
        cout << endl << name[index];
      }
    cout << endl << endl;

    return(0);
  }
#+END_SRC

* 11.1 A Parallel Array.
#+BEGIN_SRC cpp :tangle 11_1.cpp :padline no
  #include <iostream>
  #include <cstring>

  using namespace std;

  #define MAX 9        // There are 9 known planets
  #define LENGTH 8     // No name is longer than 7
  // characters
  #define TAB '\t'     // Define a tab character

  main()
  {
    char planet[MAX][LENGTH];      // planet names
    int  distance[MAX];            // distance from sun
    int  index;

    // INITIALIZE THE TWO ARRAYS
    strcpy(planet[0],"MERCURY");
    distance[0] = 58;
    strcpy(planet[1],"VENUS");
    distance[1] = 108;
    strcpy(planet[2],"EARTH");
    distance[2] = 150;
    strcpy(planet[3],"MARS");
    distance[3] = 228;
    strcpy(planet[4],"JUPITER");
    distance[4] = 778;
    strcpy(planet[5],"SATURN");
    distance[5] = 1427;
    strcpy(planet[6],"URANUS");
    distance[6] = 2869;
    strcpy(planet[7],"NEPTUNE");
    distance[7] = 4498;
    strcpy(planet[8],"PLUTO");
    distance[8] = 5900;
    cout << TAB << TAB << "PLANET" << TAB << TAB
         << "DISTANCE" << endl << endl;

    for (index = 0; index < MAX; index++)
      {
        cout << TAB << TAB << planet[index];
        cout << TAB << TAB << distance[index] << endl;
      }
    cout << endl;

    return(0);
  }
#+END_SRC

* 11.2 Vulcan Discovered At Last.
#+BEGIN_SRC cpp :tangle 11_2.cpp :padline no
  #include <iostream>
  #include <cstring>

  using namespace std;

  #define MAX 10        // There are NOW 10 known planets
  #define LENGTH 8      // No name is longer than 7
  // characters
  #define TAB '\t'      // Define a tab character

  main()
  {
    char planet[MAX][LENGTH];      // planet names
    int  distance[MAX];            // distance from sun
    int  index;

    // INITIALIZE THE TWO ARRAYS
    strcpy(planet[0],"MERCURY");
    distance[0] = 58;
    strcpy(planet[1],"VENUS");
    distance[1] = 108;
    strcpy(planet[2],"EARTH");
    distance[2] = 150;
    strcpy(planet[3],"MARS");
    distance[3] = 228;
    strcpy(planet[4],"JUPITER");
    distance[4] = 778;
    strcpy(planet[5],"SATURN");
    distance[5] = 1427;
    strcpy(planet[6],"URANUS");
    distance[6] = 2869;
    strcpy(planet[7],"NEPTUNE");
    distance[7] = 4498;
    strcpy(planet[8],"PLUTO");
    distance[8] = 5900;
    strcpy(planet[9],"VULCAN");
    distance[9] = 8992;
    cout << TAB << TAB << "PLANET" << TAB << TAB
         << "DISTANCE" << endl << endl;

    for (index = 0; index < MAX; index++)
      {
        cout << TAB << TAB << planet[index];
        cout << TAB << TAB << distance[index] << endl;
      }
    cout << endl;

    return(0);
  }
#+END_SRC

