programming/cpp/idiots-code.html
<div id="outline-container-sec-36" class="outline-2">
<h2 id="sec-36">10.1 Demo of a Two-Dimensional Array.</h2>
<div class="outline-text-2" id="text-36">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt; 

using namespace std;

#define ROW 5           // FIVE WORKING DAYS
#define COLUMN 4        // FOUR WEEKS IN MONTH

main() 
{
  int sales[ROW][COLUMN] = { 91,22,37,40,
			     58,63,99,35,
			     77,81,23,62,
			     92,15,33,29,
			     102,73,62,64};
  int down;        // go down the rows
  int across;        // go across the columns

  cout.setf(ios::right);
  cout &lt;&lt; endl;

  for (down = 0; down &lt; ROW; down++)
    {
      for (across = 0; across &lt; COLUMN; across++)
	{
	  cout.width(4);
	  cout &lt;&lt; sales[down][across];
	}
      cout &lt;&lt; endl &lt;&lt; endl;
    }

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-37" class="outline-2">
<h2 id="sec-37">10.2 Using a Two-Dimensional Array to List a Particular Row.</h2>
<div class="outline-text-2" id="text-37">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

#define ROW 5
#define COLUMN 4

main()
{
  int sales[ROW][COLUMN] = {    91,22,37,40,
				58,63,99,35,
				77,81,23,62,
				92,15,33,29,
				102,73,62,64};
  int across;        // This is the columns

  cout.setf(ios::right);
  cout &lt;&lt; endl &lt;&lt; "A Day In The Month";
  cout &lt;&lt; endl &lt;&lt; endl;

  for (across = 0; across &lt; COLUMN; across++)
    {
      cout.width(4);
      cout &lt;&lt; sales[0][across];
    }
  cout &lt;&lt; endl &lt;&lt; endl;

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-38" class="outline-2">
<h2 id="sec-38">10.3 Using a Two-Dimensional Array to List a Particular Column.</h2>
<div class="outline-text-2" id="text-38">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

#define ROW 5
#define COLUMN 4

main() 
{      
  int sales[ROW][COLUMN] = {    91,22,37,40,
				58,63,99,35,
				77,81,23,62,
				92,15,33,29,
				102,73,62,64};
  int down;        // This is the row

  cout.setf(ios::right);
  cout &lt;&lt; endl &lt;&lt; "A Week In The Month Observed.";
  cout &lt;&lt; endl &lt;&lt; endl;

  for (down = 0; down &lt; ROW; down++)
    {
      cout.width(4);
      cout &lt;&lt; sales[down][1] &lt;&lt; endl;
    }
  cout &lt;&lt; endl &lt;&lt; endl;

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-39" class="outline-2">
<h2 id="sec-39">10.4 Demo of a Three-Dimensional Array.</h2>
<div class="outline-text-2" id="text-39">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

#define ROW 5                 // FIVE WORKING DAYS
#define COLUMN 4              // FOUR WEEKS IN MONTH
#define PAGE 2                // MONTHS 1 AND 2

main()
{
  int sales[ROW][COLUMN][PAGE];
  int down;
  int across;
  int back = 0;

  sales[0][0][0] = 91;
  sales[0][1][0] = 22;
  sales[0][2][0] = 37;
  sales[0][3][0] = 40;
  sales[1][0][0] = 58;
  sales[1][1][0] = 63;
  sales[1][2][0] = 99;
  sales[1][3][0] = 35;
  sales[2][0][0] = 77;
  sales[2][1][0] = 81;
  sales[2][2][0] = 23;
  sales[2][3][0] = 62;
  sales[3][0][0] = 92;
  sales[3][1][0] = 15;
  sales[3][2][0] = 33;
  sales[3][3][0] = 29;
  sales[4][0][0] = 102;
  sales[4][1][0] = 73;
  sales[4][2][0] = 62;
  sales[4][3][0] = 64;
  sales[0][0][1] = 12;
  sales[0][1][1] = 23;
  sales[0][2][1] = 27;
  sales[0][3][1] = 42;
  sales[1][0][1] = 59;
  sales[1][1][1] = 83;
  sales[1][2][1] = 79;
  sales[1][3][1] = 75;
  sales[2][0][1] = 77;
  sales[2][1][1] = 71;
  sales[2][2][1] = 63;
  sales[2][3][1] = 72;
  sales[3][0][1] = 110;
  sales[3][1][1] = 105;
  sales[3][2][1] = 103;
  sales[3][3][1] = 109;
  sales[4][0][1] = 102;
  sales[4][1][1] = 83;
  sales[4][2][1] = 61;
  sales[4][3][1] = 63;

  cout.setf(ios::right);
  cout &lt;&lt; endl;

  for (down = 0; down &lt; ROW; down++)
    {
      for (across = 0; across &lt; COLUMN; across++)
	{
	  cout.width(4);
	  cout &lt;&lt; sales[down][across][back];
	}
      cout &lt;&lt; endl &lt;&lt; endl;
    }
  back++;
  cout &lt;&lt; endl &lt;&lt; endl;
  for (down = 0; down &lt; ROW; down++)
    {
      for (across = 0; across &lt; COLUMN; across++)
	{
	  cout.width(4);
	  cout &lt;&lt; sales[down][across][back];
	}
      cout &lt;&lt; endl &lt;&lt; endl;
    }

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-40" class="outline-2">
<h2 id="sec-40">10.5 Example of a Two-Dimensional Array of Characters.</h2>
<div class="outline-text-2" id="text-40">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;

using namespace std;

#define MAXNAMES 4        // FOUR NAMES IN ARRAY
#define MAXLENGTH 20      // NOT MORE THAN 19 CHARACTERS

main()
{
  char name[MAXNAMES][MAXLENGTH] =     {
    "DAVY CROCKETT",
    "JOHN LENNON",
    "MOHAMMED ALI",
    "WILLIAM WALLACE"};
  int index;

  for (index = 0; index &lt; MAXNAMES; index++)
    {
      cout &lt;&lt; endl &lt;&lt; name[index];
    }
  cout &lt;&lt; endl &lt;&lt; endl;

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-41" class="outline-2">
<h2 id="sec-41">11.1 A Parallel Array.</h2>
<div class="outline-text-2" id="text-41">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;
#include &lt;cstring&gt;

using namespace std;

#define MAX 9        // There are 9 known planets
#define LENGTH 8     // No name is longer than 7
// characters
#define TAB '\t'     // Define a tab character

main()
{
  char planet[MAX][LENGTH];      // planet names
  int  distance[MAX];            // distance from sun
  int  index;

  // INITIALIZE THE TWO ARRAYS
  strcpy(planet[0],"MERCURY");
  distance[0] = 58;
  strcpy(planet[1],"VENUS");
  distance[1] = 108;
  strcpy(planet[2],"EARTH");
  distance[2] = 150;
  strcpy(planet[3],"MARS");
  distance[3] = 228;
  strcpy(planet[4],"JUPITER");
  distance[4] = 778;
  strcpy(planet[5],"SATURN");
  distance[5] = 1427;
  strcpy(planet[6],"URANUS");
  distance[6] = 2869;
  strcpy(planet[7],"NEPTUNE");
  distance[7] = 4498;
  strcpy(planet[8],"PLUTO");
  distance[8] = 5900;
  cout &lt;&lt; TAB &lt;&lt; TAB &lt;&lt; "PLANET" &lt;&lt; TAB &lt;&lt; TAB
       &lt;&lt; "DISTANCE" &lt;&lt; endl &lt;&lt; endl;

  for (index = 0; index &lt; MAX; index++)
    {
      cout &lt;&lt; TAB &lt;&lt; TAB &lt;&lt; planet[index];
      cout &lt;&lt; TAB &lt;&lt; TAB &lt;&lt; distance[index] &lt;&lt; endl;
    }
  cout &lt;&lt; endl;

  return(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-42" class="outline-2">
<h2 id="sec-42">11.2 Vulcan Discovered At Last.</h2>
<div class="outline-text-2" id="text-42">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;
#include &lt;cstring&gt;

using namespace std;

#define MAX 10        // There are NOW 10 known planets
#define LENGTH 8      // No name is longer than 7
// characters
#define TAB '\t'      // Define a tab character

main()
{
  char planet[MAX][LENGTH];      // planet names
  int  distance[MAX];            // distance from sun
  int  index;

  // INITIALIZE THE TWO ARRAYS
  strcpy(planet[0],"MERCURY");
  distance[0] = 58;
  strcpy(planet[1],"VENUS");
  distance[1] = 108;
  strcpy(planet[2],"EARTH");
  distance[2] = 150;
  strcpy(planet[3],"MARS");
  distance[3] = 228;
  strcpy(planet[4],"JUPITER");
  distance[4] = 778;
  strcpy(planet[5],"SATURN");
  distance[5] = 1427;
  strcpy(planet[6],"URANUS");
  distance[6] = 2869;
  strcpy(planet[7],"NEPTUNE");
  distance[7] = 4498;
  strcpy(planet[8],"PLUTO");
  distance[8] = 5900;
  strcpy(planet[9],"VULCAN");
  distance[9] = 8992;
  cout &lt;&lt; TAB &lt;&lt; TAB &lt;&lt; "PLANET" &lt;&lt; TAB &lt;&lt; TAB
       &lt;&lt; "DISTANCE" &lt;&lt; endl &lt;&lt; endl;

  for (index = 0; index &lt; MAX; index++)
    {
      cout &lt;&lt; TAB &lt;&lt; TAB &lt;&lt; planet[index];
      cout &lt;&lt; TAB &lt;&lt; TAB &lt;&lt; distance[index] &lt;&lt; endl;
    }
  cout &lt;&lt; endl;

  return(0);
}
</pre>
</div>
</div>
</div>
