programming/cpp/idiots-code.org
* 11.3 Four Parallel Arrays.
#+BEGIN_SRC cpp :tangle 11_3.cpp :padline no
  #include <iostream>
  #include <cstring>

  using namespace std;

  #define MAX 9        // There are 9 known planets
  #define LENGTH 8     // No name is longer than 7
  // characters
  #define TAB '\t'     // Define a tab character

  main()
  {
    char  planet[MAX][LENGTH];    // planet names
    int   moons[MAX];             // number of moons
    float year[MAX];              // length of year
    int   distance[MAX];          // distance from sun
    int   index; 

    // INITIALIZE THE FOUR ARRAYS
    strcpy(planet[0],"MERCURY");
    moons[0] = 0;
    year[0] = 0.24;
    distance[0] = 58;
    strcpy(planet[1],"VENUS");
    moons[1] = 0;
    year[1] = 0.625;
    distance[1] = 108;
    strcpy(planet[2],"EARTH");
    moons[2] = 1;
    year[2] = 1;
    distance[2] = 150;
    strcpy(planet[3],"MARS");
    moons[3] = 2;
    year[3] = 1.91;
    distance[3] = 228;
    cout << TAB << TAB << "PLANET"
         << TAB << TAB << "MOONS"
         << TAB << TAB << "YEAR"
         << TAB << TAB << "DISTANCE"<< endl << endl;

    for (index = 0; index < 4; index++)
      {
        cout << TAB << TAB << planet[index];
        cout << TAB << TAB << moons[index];
        cout << TAB << TAB << year[index];
        cout << TAB << TAB << distance[index] << endl;
      }
    cout << endl;

    return(0);
  }
#+END_SRC
