programming/cpp/idiots-code.html

<div id="outline-container-sec-43" class="outline-2">
<h2 id="sec-43">11.3 Four Parallel Arrays.</h2>
<div class="outline-text-2" id="text-43">
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;
#include &lt;cstring&gt;

using namespace std;

#define MAX 9        // There are 9 known planets
#define LENGTH 8     // No name is longer than 7
// characters
#define TAB '\t'     // Define a tab character

main()
{
  char  planet[MAX][LENGTH];    // planet names
  int   moons[MAX];             // number of moons
  float year[MAX];              // length of year
  int   distance[MAX];          // distance from sun
  int   index; 

  // INITIALIZE THE FOUR ARRAYS
  strcpy(planet[0],"MERCURY");
  moons[0] = 0;
  year[0] = 0.24;
  distance[0] = 58;
  strcpy(planet[1],"VENUS");
  moons[1] = 0;
  year[1] = 0.625;
  distance[1] = 108;
  strcpy(planet[2],"EARTH");
  moons[2] = 1;
  year[2] = 1;
  distance[2] = 150;
  strcpy(planet[3],"MARS");
  moons[3] = 2;
  year[3] = 1.91;
  distance[3] = 228;
  cout &lt;&lt; TAB &lt;&lt; TAB &lt;&lt; "PLANET"
       &lt;&lt; TAB &lt;&lt; TAB &lt;&lt; "MOONS"
       &lt;&lt; TAB &lt;&lt; TAB &lt;&lt; "YEAR"
       &lt;&lt; TAB &lt;&lt; TAB &lt;&lt; "DISTANCE"&lt;&lt; endl &lt;&lt; endl;

  for (index = 0; index &lt; 4; index++)
    {
      cout &lt;&lt; TAB &lt;&lt; TAB &lt;&lt; planet[index];
      cout &lt;&lt; TAB &lt;&lt; TAB &lt;&lt; moons[index];
      cout &lt;&lt; TAB &lt;&lt; TAB &lt;&lt; year[index];
      cout &lt;&lt; TAB &lt;&lt; TAB &lt;&lt; distance[index] &lt;&lt; endl;
    }
  cout &lt;&lt; endl;

  return(0);
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
